module.exports.config = {
  name: "autotimer",
  version: "2.0",
  role: 0,
  author: "Dipto",
  description: "সেট করা সময় অনুযায়ী স্বয়ংক্রিয়ভাবে বার্তাগুলি পাঠানো হবে!",
  category: "AutoTime",
  countDown: 3,
};

module.exports.onLoad = async ({ api }) => {
  const timerData = {
      "12:00:00 PM": {
        message: "‎┌──• 𝗧𝗜𝗠𝗘 • 𝗨𝗣𝗗𝗔𝗧𝗘 •───┐\n│➛🔔-এখন-সময়-রাত-🔔\n│➛⏰ 𝟭𝟮:𝟬𝟬 𝗣𝗠 ⏰\n│➛📌 আমার বউ নাই তাই ঘুম ও আসে না....!!🙂\n╰─────────────────⭓",
        url: null
      },
      "01:00:00 AM": {
        message: "‎┌──• 𝗧𝗜𝗠𝗘 • 𝗨𝗣𝗗𝗔𝗧𝗘 •───┐\n│➛🔔-এখন-সময়-রাত-🔔\n│➛⏰ 𝟬𝟭:𝟬𝟬 𝗔𝗠 ⏰\n│➛📌 প্রেম না কইরা যাইয়া ঘুমা বেক্কল..!!😾\n╰─────────────────⭓",
        url: null
      },
      "02:00:00 AM": {
        message: "‎┌──• 𝗧𝗜𝗠𝗘 • 𝗨𝗣𝗗𝗔𝗧𝗘 •───┐\n│➛🔔-এখন-সময়-রাত-🔔\n│➛⏰ 𝟬𝟮:𝟬𝟬 𝗔𝗠 ⏰\n│➛📌 যারা ছ্যাকা খাইছে তারা জেগে আছে..!!🙂\n╰─────────────────⭓",
        url: null
      },
      "03:00:00 AM": {
        message: "‎┌──• 𝗧𝗜𝗠𝗘 • 𝗨𝗣𝗗𝗔𝗧𝗘 •───┐\n│➛🔔-এখন-সময়-রাত-🔔\n│➛⏰ 𝟬𝟯:𝟬𝟬 𝗔𝗠 ⏰\n│➛📌 আমার ভাই ঘুম আসে না ভাই..!!🙂\n╰─────────────────⭓",
        url: null
      },
      "04:00:00 AM": {
        message: "‎┌──• 𝗧𝗜𝗠𝗘 • 𝗨𝗣𝗗𝗔𝗧𝗘 •───┐\n│➛🔔-এখন-সময়-ভোর-🔔\n│➛⏰ 𝟬𝟰:𝟬𝟬 𝗔𝗠 ⏰\n│➛📌 একটু পর ফজরের আযান দিবে নামাজ পড়ে নিও..!!🙂\n╰─────────────────⭓",
        url: null
      },
      "05:00:00 AM": {
        message: "‎┌──• 𝗧𝗜𝗠𝗘 • 𝗨𝗣𝗗𝗔𝗧𝗘 •───┐\n│➛🔔-এখন-সময়-সকাল-🔔\n│➛⏰ 𝟬𝟱:𝟬𝟬 𝗔𝗠 ⏰\n│➛📌 সবাই নামাজ পড়ছো তো ?..!!🙂\n╰─────────────────⭓",
        url: null
      },
      "06:00:00 AM": {
        message: "‎┌──• 𝗧𝗜𝗠𝗘 • 𝗨𝗣𝗗𝗔𝗧𝗘 •───┐\n│➛🔔-এখন-সময়-সকাল-🔔\n│➛⏰ 𝟬𝟲:𝟬𝟬 𝗔𝗠 ⏰\n│➛📌 ঘুম থেকে উঠো সবাই..!!🙂\n╰─────────────────⭓",
        url: null
      },
      "07:00:00 AM": {
        message: "‎┌──• 𝗧𝗜𝗠𝗘 • 𝗨𝗣𝗗𝗔𝗧𝗘 •───┐\n│➛🔔-এখন-সময়-সকাল-🔔\n│➛⏰ 𝟬𝟳:𝟬𝟬 𝗔𝗠 ⏰\n│➛📌 সবাই ব্রেকফাস্ট করে নাও..!!🙂\n╰─────────────────⭓",
        url: null
      },
      "08:00:00 AM": {
        message: "‎┌──• 𝗧𝗜𝗠𝗘 • 𝗨𝗣𝗗𝗔𝗧𝗘 •───┐\n│➛🔔-এখন-সময়-সকাল-🔔\n│➛⏰ 𝟬𝟴:𝟬𝟬 𝗔𝗠 ⏰\n│➛📌 সবাই মনে হয় কাজে ব্যস্ত হয়ে গেছো..!!🙂\n╰─────────────────⭓",
        url: null
      },
      "09:00:00 AM": {
        message: "‎┌──• 𝗧𝗜𝗠𝗘 • 𝗨𝗣𝗗𝗔𝗧𝗘 •───┐\n│➛🔔-এখন-সময়-সকাল-🔔\n│➛⏰ 𝟬𝟵:𝟬𝟬 𝗔𝗠 ⏰\n│➛📌 মন দিয়ে কাজ করো সবাই..!!🙂\n╰─────────────────⭓",
        url: null
      },
      "10:00:00 AM": {
        message: "‎┌──• 𝗧𝗜𝗠𝗘 • 𝗨𝗣𝗗𝗔𝗧𝗘 •───┐\n│➛🔔-এখন-সময়-সকাল-🔔\n│➛⏰ 𝟭𝟬:𝟬𝟬 𝗔𝗠 ⏰\n│➛📌 খুব মিস করছি তোমাদের..!!🙂\n╰─────────────────⭓",
        url: null
      },
      "11:00:00 AM": {
        message: "‎ ‎╭──────────────────╮\n   🌸𝐄𝐯𝐞𝐫𝐲 𝐌𝐮𝐬𝐥𝐢𝐦𝐬 𝐈𝐝𝐞𝐧𝐭𝐢𝐭𝐲 🌸\n╰──────────────────╯\n𝙽𝚊𝚖𝚎                     : 𝙼𝚞𝚜𝚕𝚒𝚖\n𝙵𝚊𝚝𝚑𝚎𝚛'𝚜 𝙽𝚊𝚖𝚎  : 𝙰𝚍𝚘𝚖 (আ:)\n𝙲𝚛𝚎𝚊𝚝𝚘𝚛              : 𝙰𝚕𝚕𝚊𝚑\n𝙸𝚍𝚎𝚊𝚕                   : 𝙼𝚞𝚑𝚊𝚖𝚖𝚊𝚍 (সা.) \n𝙷𝚘𝚕𝚢 𝙱𝚘𝚘𝚔           : 𝚀𝚞𝚛𝚊𝚗\n𝚁𝚎𝚕𝚒𝚐𝚒𝚘𝚗            : 𝙸𝚜𝚕𝚊𝚖\n𝙸𝚍𝚎𝚗𝚝𝚒𝚝             : لَا إِلٰهَ إِلَّا الله مُحَمَّدٌ رَسُولُ الله• \n𝙷𝚘𝚋𝚋𝚒𝚎𝚜               : 𝙽𝚊𝚖𝚊𝚓 𝟻 𝚃𝚒𝚖𝚎𝚜 𝙰 𝙳𝚊𝚢\n𝙿𝚛𝚎𝚜𝚎𝚗𝚝 𝙰𝚍𝚍𝚛𝚎𝚜𝚜        : 𝙳𝚞𝚗𝚒𝚢𝚊\n𝙿𝚎𝚛𝚖𝚊𝚗𝚎𝚗𝚝 𝙰𝚍𝚍𝚛𝚎𝚜𝚜   : 𝙹𝚊𝚗𝚗𝚊𝚝 (𝙸𝚗 𝚂𝚊𝚑 𝙰𝚕𝚕𝚊𝚑)",
        url: null
      },
      "12:00:00 PM": {
        message: "‎┌──• 𝗧𝗜𝗠𝗘 • 𝗨𝗣𝗗𝗔𝗧𝗘 •───┐\n│➛🔔-এখন-সময়-দুপুর-🔔\n│➛⏰ 𝟭𝟮:𝟬𝟬 𝗣𝗠 ⏰\n│➛📌 ❐-অধিক মায়া অশান্তির কারণ..!!🙂\n╰─────────────────⭓",
        url: null
      },
      "01:00:00 PM": {
        message: "‎┌──• 𝗧𝗜𝗠𝗘 • 𝗨𝗣𝗗𝗔𝗧𝗘 •───┐\n│➛🔔-এখন-সময়-দুপুর-🔔\n│➛⏰ 𝟬𝟭:𝟬𝟬 𝗣𝗠 ⏰\n│➛📌  জোহরের নামাজ পড়ে নাও..!!🙂\n╰─────────────────⭓",
        url: null
      },
      "02:00:00 PM": {
        message: "‎┌──• 𝗧𝗜𝗠𝗘 • 𝗨𝗣𝗗𝗔𝗧𝗘 •───┐\n│➛🔔-এখন-সময়-দুপুর-🔔\n│➛⏰ 𝟬𝟮:𝟬𝟬 𝗣𝗠 ⏰\n│➛📌 সবাই দুপুরের খাবার খেয়ে নাও..!!🙂\n╰─────────────────⭓",
        url: null
      },
      "03:00:00 PM": {
        message: "‎┌──• 𝗧𝗜𝗠𝗘 • 𝗨𝗣𝗗𝗔𝗧𝗘 •───┐\n│➛🔔-এখন-সময়-দুপুর-🔔\n│➛⏰ 𝟬𝟯:𝟬𝟬 𝗣𝗠 ⏰\n│➛📌 ❐-অধিক মায়া অশান্তির কারণ..❤️‍🩹🪽\n╰─────────────────⭓",
        url: null
      },
      "04:00:00 PM": {
        message: "‎┌──• 𝗧𝗜𝗠𝗘 • 𝗨𝗣𝗗𝗔𝗧𝗘 •───┐\n│➛🔔-এখন-সময়-বিকাল-🔔\n│➛⏰ 𝟬𝟰:𝟬𝟬 𝗣𝗠 ⏰\n│➛📌 আযান দিলে সবাই নামাজ পড়ে নিও..!!🙂\n╰─────────────────⭓",
        url: null
      },
      "05:00:00 PM": {
        message: "‎┌──• 𝗧𝗜𝗠𝗘 • 𝗨𝗣𝗗𝗔𝗧𝗘 •───┐\n│➛🔔-এখন-সময়-বিকাল-🔔\n│➛⏰ 𝟬𝟱:𝟬𝟬 𝗣𝗠 ⏰\n│➛📌 সবাই হাতমুখ ধুয়ে কিছু খেয়ে নাও..!!🙂\n╰─────────────────⭓",
        url: null
      },
      "06:00:00 PM": {
        message: "‎┌──• 𝗧𝗜𝗠𝗘 • 𝗨𝗣𝗗𝗔𝗧𝗘 •───┐\n│➛🔔-এখন-সময়-সন্ধ্যা-🔔\n│➛⏰ 𝟬𝟲:𝟬𝟬 𝗣𝗠 ⏰\n│➛📌 মাগরিবের আযান দিলে সবাই নামাজ পড়ে নিও..!!🙂\n╰─────────────────⭓",
        url: null
      },
      "07:00:00 PM": {
        message: "‎┌──• 𝗧𝗜𝗠𝗘 • 𝗨𝗣𝗗𝗔𝗧𝗘 •───┐\n│➛🔔-এখন-সময়-সন্ধ্যা-🔔\n│➛⏰ 𝟬𝟳:𝟬𝟬 𝗣𝗠 ⏰\n│➛📌 ❐- শিক্ষার চেয়ে মনুষ্যত্ব বড়-💚🪽\n╰─────────────────⭓",
        url: null
      },
      "08:00:00 PM": {
        message: "‎┌──• 𝗧𝗜𝗠𝗘 • 𝗨𝗣𝗗𝗔𝗧𝗘 •───┐\n│➛🔔-এখন-সময়-রাত-🔔\n│➛⏰ 𝟬𝟴:𝟬𝟬 𝗣𝗠 ⏰\n│➛📌 এশার আযান দিবে সবাই নামাজ পড়ে নিও..!!🙂\n╰─────────────────⭓",
        url: null
      },
      "09:00:00 PM": {
        message: "‎┌──• 𝗧𝗜𝗠𝗘 • 𝗨𝗣𝗗𝗔𝗧𝗘 •───┐\n│➛🔔-এখন-সময়-রাত-🔔\n│➛⏰ 𝟬𝟵:𝟬𝟬 𝗣𝗠 ⏰\n│➛📌 ❐—পূর্ণতার মালিক আল্লাহ..🩵🪽\n╰─────────────────⭓",
        url: null
      },
      "10:00:00 PM": {
        message: "‎┌──• 𝗧𝗜𝗠𝗘 • 𝗨𝗣𝗗𝗔𝗧𝗘 •───┐\n│➛🔔-এখন-সময়-রাত-🔔\n│➛⏰ 𝟭𝟬:𝟬𝟬 𝗣𝗠 ⏰\n│➛📌 সবাই কি শুয়ে পড়লা..!!🙂\n╰─────────────────⭓",
        url: null
      },
      "11:00:00 PM": {
        message: "‎┌──• 𝗧𝗜𝗠𝗘 • 𝗨𝗣𝗗𝗔𝗧𝗘 •───┐\n│➛🔔-এখন-সময়-রাত-🔔\n│➛⏰ 𝟭𝟭:𝟬𝟬 𝗣𝗠 ⏰\n│➛📌 ঘুমিয়ে পড়ো বাচ্চারা..!!🙂\n╰─────────────────⭓",
        url: null
      }
  };
  if(timerData){
const checkTimeAndSendMessage = async() => { 
  const currentTime = new Date(Date.now() + 21600000).toLocaleTimeString('en-US', {
    hour: '2-digit',
    minute: '2-digit',
    second: '2-digit',
    hour12: true
  }).split(',').pop().trim(); 
  // const attachment = await global.utils.getStreamFromURL(timerData[currentTime].url);
  
    if (timerData[currentTime]) global.GoatBot.config.whiteListModeThread.whiteListThreadIds.forEach(async threadID => await api.sendMessage({body: timerData[currentTime].message/*, attachment*/}, threadID)); 
    setTimeout(checkTimeAndSendMessage, 1200 - new Date().getMilliseconds()); 
   }; 
  checkTimeAndSendMessage();
 }
};

module.exports.onStart = ({}) => {};

